src/Documents/Scan_ЧекЛистТехническогоСостоянияИзделия/Scan_ЧекЛистТехническогоСостоянияИзделия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЧекЛистТехническогоСостоянияИзделия</name>
  <comment>Чек лист технического состояния продукта (scania)</comment>
  <registerRecords>InformationRegister.Scan_РеестрОказанныхУслуг</registerRecords>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСИсполнителем</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполненияКТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаВыполненияКТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КТСВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОказаннаяУслуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимостьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокКТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>EnumRef.Scan_ПричиныНевыполненияКТС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабот</name>
    <attributes>
      <name>Работы</name>
      <type>
        <types>CatalogRef.Scan_СервисныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Составляющая</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеСервисныхОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБыло</name>
      <type>
        <types>CatalogRef.Scan_ЕмкостиАКБ</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСтало</name>
      <type>
        <types>CatalogRef.Scan_ЕмкостиАКБ</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_МатрицаХраненияИзделий/Scan_МатрицаХраненияИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаХраненияИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.Scan_КонтрольныеДатыХраненияИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЧекЛистТехническогоСостоянияИзделия</types>
      <types>DocumentRef.Scan_ДвижениеИзделий</types>
      <types>DocumentRef.Scan_ПеремещениеИзделий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_РеестрОказанныхУслуг/Scan_РеестрОказанныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_РеестрОказанныхУслуг</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураУслуги</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПродукта</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоставкиФакт</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ДанныеПоАКБИзделий/Scan_ДанныеПоАКБИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ДанныеПоАКБИзделий</name>
  <comment>Данные по АКБ продуктов (scania)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПусковойТок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеБезНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеПодНагрузкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Емкость</name>
    <type>
      <types>CatalogRef.Scan_ЕмкостиАКБ</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.Scan_СостоянияАКБ</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АКБ</name>
    <type>
      <types>CatalogRef.Scan_АккумуляторныеБатареи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_КонтрольныеДатыХраненияИзделий/Scan_КонтрольныеДатыХраненияИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_КонтрольныеДатыХраненияИзделий</name>
  <enumValues>
    <name>ДатаПостановкиНаХранение</name>
  </enumValues>
  <enumValues>
    <name>ДатаВыполненияКТСПлан</name>
  </enumValues>
  <enumValues>
    <name>ДатаВыполненияКТСФакт</name>
  </enumValues>
  <enumValues>
    <name>ДатаСнятияСХранения</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиИзделия</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ХарактеристикиАКБ/Scan_ХарактеристикиАКБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ХарактеристикиАКБ</name>
  <enumValues>
    <name>Плотность</name>
  </enumValues>
  <enumValues>
    <name>ПусковойТок</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеБезНагрузки</name>
  </enumValues>
  <enumValues>
    <name>НапряжениеПодНагрузкой</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Scan_ЧекЛистТехническогоСостоянияИзделия/ObjectModule.bsl
//rarus tenkam 18.11.2017 9427 7183 ++

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДата();
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//rarus vikhle 14.07.2021 m 17459 +++
	Если ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.Scan_МатрицаХраненияИзделий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи данных в матрицу хранения продуктов'; en = 'Action failed '"));
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;	
	//rarus vikhle 14.07.2021 m 17459 ---
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ПлановаяДатаВыполненияКТС) Тогда
		// rarus tenkam 27.06.2019 mantis 14427 +++			
		//ТекПродукт = РегистрыСведений.Scan_ВзаимосвязьИзделийПродуктовИЗаказов.ПолучитьПродуктПоИзделию(Изделие);		// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
		// rarus tenkam 27.06.2019 mantis 14427 ---			
		НаборЗаписей = РегистрыСведений.Scan_МатрицаХраненияИзделий.СоздатьНаборЗаписей();
		// rarus tenkam 27.06.2019 mantis 14427 +++			
		//НаборЗаписей.Отбор.Продукт.Установить(ТекПродукт);		// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
		НаборЗаписей.Отбор.Изделие.Установить(Изделие);
		// rarus tenkam 27.06.2019 mantis 14427 ---			
		НаборЗаписей.Отбор.МестоХранения.Установить(МестоХранения);
		НаборЗаписей.Отбор.Реквизит.Установить(Перечисления.Scan_КонтрольныеДатыХраненияИзделий.ДатаВыполненияКТСПлан);	
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НаборЗаписей.Прочитать(); 			
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			// rarus tenkam 27.06.2019 mantis 14427 +++			
			//НоваяЗапись.Продукт = ТекПродукт;	// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
			НоваяЗапись.Изделие = Изделие;
			// rarus tenkam 27.06.2019 mantis 14427 ---			
			НоваяЗапись.МестоХранения = МестоХранения;
			НоваяЗапись.Реквизит = Перечисления.Scan_КонтрольныеДатыХраненияИзделий.ДатаВыполненияКТСПлан;
			НоваяЗапись.Значение = ПлановаяДатаВыполненияКТС;
			НоваяЗапись.Период   = ТекущаяДата();
			НоваяЗапись.Документ = Ссылка;
			НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();		
		Иначе
			ТекЗапись = НаборЗаписей[0];				
			Если ТекЗапись.Значение <> ПлановаяДатаВыполненияКТС Тогда
				ТекЗапись.Значение = ПлановаяДатаВыполненияКТС;
				ТекЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			//rarus FominskiyAS 08.07.2019  mantis 14191 +++
			//Сообщить(НСтр("ru = 'Ошибка записи данных в матрицу хранения изделий'"));
			Сообщить(НСтр("ru = 'Ошибка записи данных в матрицу хранения продуктов'; en = 'Action failed '"));
			//rarus FominskiyAS 08.07.2019  mantis 14191 ---
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	Если КТСВыполнен Тогда
		Если ЗначениеЗаполнено(ФактическаяДатаВыполненияКТС) Тогда
			// rarus tenkam 27.06.2019 mantis 14427 +++
			//ТекПродукт = РегистрыСведений.Scan_ВзаимосвязьИзделийПродуктовИЗаказов.ПолучитьПродуктПоИзделию(Изделие);		// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
			// rarus tenkam 27.06.2019 mantis 14427 ---
			
			НаборЗаписей = РегистрыСведений.Scan_МатрицаХраненияИзделий.СоздатьНаборЗаписей();
			
			// rarus tenkam 27.06.2019 mantis 14427 +++			
			//НаборЗаписей.Отбор.Продукт.Установить(ТекПродукт);		// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
			НаборЗаписей.Отбор.Изделие.Установить(Изделие);
			// rarus tenkam 27.06.2019 mantis 14427 ---
			
			НаборЗаписей.Отбор.МестоХранения.Установить(МестоХранения);
			НаборЗаписей.Отбор.Реквизит.Установить(Перечисления.Scan_КонтрольныеДатыХраненияИзделий.ДатаВыполненияКТСФакт);	
			НаборЗаписей.Отбор.Документ.Установить(Ссылка);
			НаборЗаписей.Прочитать(); 			
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				// rarus tenkam 27.06.2019 mantis 14427 +++			
				//НоваяЗапись.Продукт = ТекПродукт; 	// rarus tenkam 22.07.2019 mantis 14662 + раскомментировано, удалить по 14430 +
				НоваяЗапись.Изделие = Изделие;
				// rarus tenkam 27.06.2019 mantis 14427 ---
			
				НоваяЗапись.МестоХранения = МестоХранения;
				НоваяЗапись.Реквизит = Перечисления.Scan_КонтрольныеДатыХраненияИзделий.ДатаВыполненияКТСФакт;
				НоваяЗапись.Значение = ФактическаяДатаВыполненияКТС;
				НоваяЗапись.Период   = ТекущаяДата();
				НоваяЗапись.Документ = Ссылка;
				НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();		
			Иначе
				ТекЗапись = НаборЗаписей[0];				
				Если ТекЗапись.Значение <> ФактическаяДатаВыполненияКТС Тогда
					ТекЗапись.Значение = ФактическаяДатаВыполненияКТС;
					ТекЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				//rarus FominskiyAS 08.07.2019  mantis 14191 +++
				//Сообщить(НСтр("ru = 'Ошибка записи данных в матрицу хранения изделий'"));
				Сообщить(НСтр("ru = 'Ошибка записи данных в матрицу хранения продуктов'; en = 'Action failed '"));
				//rarus FominskiyAS 08.07.2019  mantis 14191 ---
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;	
		
		Если НЕ Отказ Тогда
			Если ЗначениеЗаполнено(ОказаннаяУслуга) И ЗначениеЗаполнено(ОбщаяСтоимостьУслуги) Тогда
				// регистр Scan_РеестрОказанныхУслуг
				Движения.Scan_РеестрОказанныхУслуг.Записывать = Истина;
				Движение = Движения.Scan_РеестрОказанныхУслуг.Добавить();
				Движение.Регистратор = Ссылка;
				Движение.Изделие = Изделие;
				Движение.Контрагент = Исполнитель;
				Движение.ДоговорКонтрагента = ДоговорСИсполнителем;
				Движение.НоменклатураУслуги = ОказаннаяУслуга;
				
				Движение.СтавкаНДС = ДоговорСИсполнителем.СтавкаНДС;
				Если ДоговорСИсполнителем.ВключаетНДС Тогда
					СуммаНДС = ОбщаяСтоимостьУслуги * ДоговорСИсполнителем.СтавкаНДС.Ставка / (100 + ДоговорСИсполнителем.СтавкаНДС.Ставка);
					СуммаРегистра = ОбщаяСтоимостьУслуги - СуммаНДС;
				Иначе
					СуммаНДС = ОбщаяСтоимостьУслуги * ДоговорСИсполнителем.СтавкаНДС.Ставка / 100; 
					СуммаРегистра = ОбщаяСтоимостьУслуги;
				КонецЕсли;
				Движение.СуммаНДС = СуммаНДС; 				
				Движение.Сумма = СуммаРегистра;
				Движение.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
				
				ГруппаИзделия =  Изделие.ТипПродукта.ВидПродукта.ГруппаПродукта;
				Если ГруппаИзделия = Справочники.Scan_ГруппыПродуктов.ТранспортныеСредства Тогда
					ЛогТип = Изделие.ТипПродуктаЛогистический;
					КолФормула = Изделие.МодельПродукта.КолеснаяФормула;
				Иначе 
					ЛогТип = Справочники.Scan_ТипыПродуктовЛогистика.ПустаяСсылка();
					КолФормула = Справочники.Scan_КолесныеФормулыИзделий.ПустаяСсылка();
				КонецЕсли;
				Движение.ГруппаПродукта = ГруппаИзделия;
				Движение.ЛогистическийТип = ЛогТип;
				Движение.КолеснаяФормула = КолФормула;
				Движение.ДатаДоставкиФакт = ФактическаяДатаВыполненияКТС; 
				
			КонецЕсли;
			
			// rarus tenkam 08.02.2018 mantis 12721 +++
			// Данные по АКБ
			ВСоставеЕстьАКБ1 = Ложь;
			ВСоставеЕстьАКБ2 = Ложь;
			Если Документы.Scan_ЧекЛистТехническогоСостоянияИзделия.ЕстьПроверкаУровняЗаряженностиАКБ(Ссылка, ВСоставеЕстьАКБ1, ВСоставеЕстьАКБ2) Тогда
				
				Если ВСоставеЕстьАКБ1 Тогда
					АКБИзделия1 = Справочники.Scan_АккумуляторныеБатареи.ПолучитьАКБ(Изделие, 1);
					Если ЗначениеЗаполнено(АКБИзделия1) Тогда
						
						СтруктураХарактеристикБыло = Новый Структура;
						СтруктураХарактеристикСтало = Новый Структура;
						
						СоответствиеХарактеристикБыло = Новый Соответствие;
						СоответствиеХарактеристикСтало = Новый Соответствие;
						Для Каждого ТекСтрока Из СписокРабот Цикл
							Если ТекСтрока.Составляющая.Код = "100000001" И ТекСтрока.Составляющая.Наименование = "Емкость" Тогда
								СтруктураХарактеристикБыло.Вставить("Емкость", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("Емкость", ТекСтрока.РезультатСтало);
							ИначеЕсли ТекСтрока.Составляющая.Код = "100000002" И ТекСтрока.Составляющая.Наименование = "Плотность" Тогда 
								СтруктураХарактеристикБыло.Вставить("Плотность", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("Плотность", ТекСтрока.РезультатСтало);
							ИначеЕсли ТекСтрока.Составляющая.Код = "100000003" И ТекСтрока.Составляющая.Наименование = "Пусковой ток" Тогда 
								СтруктураХарактеристикБыло.Вставить("ПусковойТок", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("ПусковойТок", ТекСтрока.РезультатСтало);
								
							ИначеЕсли ТекСтрока.Составляющая.Код = "100000004" И ТекСтрока.Составляющая.Наименование = "Напряжение без нагрузки" Тогда 
								СтруктураХарактеристикБыло.Вставить("НапряжениеБезНагрузки", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("НапряжениеБезНагрузки", ТекСтрока.РезультатСтало);
								
							ИначеЕсли ТекСтрока.Составляющая.Код = "100000005" И ТекСтрока.Составляющая.Наименование = "Напряжение под нагрузкой" Тогда 
								СтруктураХарактеристикБыло.Вставить("НапряжениеПодНагрузкой", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("НапряжениеПодНагрузкой", ТекСтрока.РезультатСтало);
								
							КонецЕсли;
						КонецЦикла;
						
						СоответствиеХарактеристикБыло.Вставить("Емкость", СтруктураХарактеристикБыло.Емкость);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), СтруктураХарактеристикБыло.Плотность);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), СтруктураХарактеристикБыло.ПусковойТок);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), СтруктураХарактеристикБыло.НапряжениеБезНагрузки);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), СтруктураХарактеристикБыло.НапряжениеПодНагрузкой);
						СостояниеБыло = Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристикБыло);
						СтруктураХарактеристикБыло.Вставить("Состояние", СостояниеБыло);
						
						СоответствиеХарактеристикСтало.Вставить("Емкость", СтруктураХарактеристикСтало.Емкость);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), СтруктураХарактеристикСтало.Плотность);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), СтруктураХарактеристикСтало.ПусковойТок);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), СтруктураХарактеристикСтало.НапряжениеБезНагрузки);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), СтруктураХарактеристикСтало.НапряжениеПодНагрузкой);
						СостояниеСтало = Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристикСтало);
						СтруктураХарактеристикСтало.Вставить("Состояние", СостояниеСтало);
						
						РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(АКБИзделия1, Изделие,СтруктураХарактеристикБыло, ФактическаяДатаВыполненияКТС);
						РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(АКБИзделия1, Изделие,СтруктураХарактеристикСтало, ФактическаяДатаВыполненияКТС + 4*60*60);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ВСоставеЕстьАКБ2 Тогда
					АКБИзделия2 = Справочники.Scan_АккумуляторныеБатареи.ПолучитьАКБ(Изделие, 2);
					Если ЗначениеЗаполнено(АКБИзделия2) Тогда
						
						СтруктураХарактеристикБыло = Новый Структура;
						СтруктураХарактеристикСтало = Новый Структура;
						
						СоответствиеХарактеристикБыло = Новый Соответствие;
						СоответствиеХарактеристикСтало = Новый Соответствие;
						Для Каждого ТекСтрока Из СписокРабот Цикл
							Если ТекСтрока.Составляющая.Код = "200000001" И ТекСтрока.Составляющая.Наименование = "Емкость" Тогда
								СтруктураХарактеристикБыло.Вставить("Емкость", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("Емкость", ТекСтрока.РезультатСтало);
							ИначеЕсли ТекСтрока.Составляющая.Код = "200000002" И ТекСтрока.Составляющая.Наименование = "Плотность" Тогда 
								СтруктураХарактеристикБыло.Вставить("Плотность", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("Плотность", ТекСтрока.РезультатСтало);
							ИначеЕсли ТекСтрока.Составляющая.Код = "200000003" И ТекСтрока.Составляющая.Наименование = "Пусковой ток" Тогда 
								СтруктураХарактеристикБыло.Вставить("ПусковойТок", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("ПусковойТок", ТекСтрока.РезультатСтало);
								
							ИначеЕсли ТекСтрока.Составляющая.Код = "200000004" И ТекСтрока.Составляющая.Наименование = "Напряжение без нагрузки" Тогда 
								СтруктураХарактеристикБыло.Вставить("НапряжениеБезНагрузки", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("НапряжениеБезНагрузки", ТекСтрока.РезультатСтало);
								
							ИначеЕсли ТекСтрока.Составляющая.Код = "200000005" И ТекСтрока.Составляющая.Наименование = "Напряжение под нагрузкой" Тогда 
								СтруктураХарактеристикБыло.Вставить("НапряжениеПодНагрузкой", ТекСтрока.РезультатБыло);
								СтруктураХарактеристикСтало.Вставить("НапряжениеПодНагрузкой", ТекСтрока.РезультатСтало);
								
							КонецЕсли;
						КонецЦикла;
						
						СоответствиеХарактеристикБыло.Вставить("Емкость", СтруктураХарактеристикБыло.Емкость);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), СтруктураХарактеристикБыло.Плотность);	// rarus tenkam 14.03.2018 mantis 12900 + (были перепутаны плотность и пусковой ток) 
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), СтруктураХарактеристикБыло.ПусковойТок);	// rarus tenkam 14.03.2018 mantis 12900 + (были перепутаны плотность и пусковой ток) 
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), СтруктураХарактеристикБыло.НапряжениеБезНагрузки);
						СоответствиеХарактеристикБыло.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), СтруктураХарактеристикБыло.НапряжениеПодНагрузкой);
						СостояниеБыло = Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристикБыло);
						СтруктураХарактеристикБыло.Вставить("Состояние", СостояниеБыло);
						
						СоответствиеХарактеристикСтало.Вставить("Емкость", СтруктураХарактеристикСтало.Емкость);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.Плотность"), СтруктураХарактеристикСтало.Плотность);	// rarus tenkam 14.03.2018 mantis 12900 + (были перепутаны плотность и пусковой ток)  
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.ПусковойТок"), СтруктураХарактеристикСтало.ПусковойТок);	// rarus tenkam 14.03.2018 mantis 12900 + (были перепутаны плотность и пусковой ток) 
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеБезНагрузки"), СтруктураХарактеристикСтало.НапряжениеБезНагрузки);
						СоответствиеХарактеристикСтало.Вставить(ПредопределенноеЗначение("Перечисление.Scan_ХарактеристикиАКБ.НапряжениеПодНагрузкой"), СтруктураХарактеристикСтало.НапряжениеПодНагрузкой);
						СостояниеСтало = Справочники.Scan_СостоянияАКБ.ПолучитьСостояниеПоХарактеристикам(СоответствиеХарактеристикСтало);
						// rarus tenkam 14.03.2018 mantis 12900 +++
						//СтруктураХарактеристикСтало.Вставить("Состояние", СостояниеБыло);
						СтруктураХарактеристикСтало.Вставить("Состояние", СостояниеСтало);
						// rarus tenkam 14.03.2018 mantis 12900 ---
						
						РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(АКБИзделия2, Изделие,СтруктураХарактеристикБыло, ФактическаяДатаВыполненияКТС);
						РегистрыСведений.Scan_ДанныеПоАКБИзделий.ЗаписатьХарактеристикиАКБ(АКБИзделия2, Изделие,СтруктураХарактеристикСтало, ФактическаяДатаВыполненияКТС + 4*60*60);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;				
			// rarus tenkam 08.02.2018 mantis 12721 ---
		КонецЕсли;
	КонецЕсли;
				
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтарыйЧекЛист = Документы.Scan_ЧекЛистТехническогоСостоянияИзделия.ПолучитьАктуальныйЧекЛист(Изделие, Ссылка);
	Если ЗначениеЗаполнено(СтарыйЧекЛист) Тогда
		Отказ = Истина;
		Сообщить("Для продукта " + Изделие + " уже есть чек лист технического состояния: " + СтарыйЧекЛист);
	КонецЕсли;	
	
	// Проверка на заполнение табличной части
	Если ЗначениеЗаполнено(ФактическаяДатаВыполненияКТС) И ЗначениеЗаполнено(Изделие) И ЗначениеЗаполнено(МестоХранения) Тогда
		ДатаПостановкиНаХранение = РегистрыСведений.Scan_МатрицаХраненияИзделий.ПолучитьДатуПостановкиНаХранение(Изделие, МестоХранения, Ссылка, ПлановаяДатаВыполненияКТС);
		
		Если ФактическаяДатаВыполненияКТС <= ДатаПостановкиНаХранение Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата выполнения КТС (факт) не может быть меньше или равна дате постановки на хранение";
			Сообщение.Поле = "ФактическаяДатаВыполненияКТС";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) // rarus tenkam 28.07.2021 mantis 17459 ++
	НаборЗаписей = РегистрыСведений.Scan_МатрицаХраненияИзделий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Изделие.Установить(Изделие);
	НаборЗаписей.Отбор.МестоХранения.Установить(МестоХранения);
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Записать(); 		
КонецПроцедуры // rarus tenkam 28.07.2021 mantis 17459 --
